
## Plan Result




<pre><code>Plan: 14 to add, 2 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.create_updates__premium_queue_listen_conn_str
  * azurerm_key_vault_secret.create_updates__premium_queue_send_conn_str
  * azurerm_key_vault_secret.create_updates_premium_queue_max_delivery_count
  * azurerm_key_vault_secret.update_case_premium_queue_listen_conn_str
  * azurerm_key_vault_secret.update_case_premium_queue_max_delivery_count
  * azurerm_key_vault_secret.update_case_premium_queue_send_conn_str
  * module.create-updates-premium-queue.azurerm_servicebus_queue.servicebus_queue
  * module.create-updates-premium-queue.azurerm_servicebus_queue_authorization_rule.listen_auth_rule
  * module.create-updates-premium-queue.azurerm_servicebus_queue_authorization_rule.send_auth_rule
  * module.servicebus-namespace-premium.azurerm_servicebus_namespace.servicebus_namespace
  * module.servicebus-namespace-premium.azurerm_servicebus_namespace_authorization_rule.send_listen_auth_rule
  * module.update-case-premium-queue.azurerm_servicebus_queue.servicebus_queue
  * module.update-case-premium-queue.azurerm_servicebus_queue_authorization_rule.listen_auth_rule
  * module.update-case-premium-queue.azurerm_servicebus_queue_authorization_rule.send_auth_rule
* Update
  * azurerm_resource_group.rg
  * module.key-vault.azurerm_monitor_diagnostic_setting.kv-ds


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.create_updates__premium_queue_listen_conn_str will be created
  + resource "azurerm_key_vault_secret" "create_updates__premium_queue_listen_conn_str" {
      + id             = (known after apply)
      + key_vault_id   = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ethos-aat/providers/Microsoft.KeyVault/vaults/ethos-shared-aat"
      + name           = "create-updates--premium-queue-listen-connection-string"
      + value          = (sensitive value)
      + version        = (known after apply)
      + versionless_id = (known after apply)
    }

  # azurerm_key_vault_secret.create_updates__premium_queue_send_conn_str will be created
  + resource "azurerm_key_vault_secret" "create_updates__premium_queue_send_conn_str" {
      + id             = (known after apply)
      + key_vault_id   = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ethos-aat/providers/Microsoft.KeyVault/vaults/ethos-shared-aat"
      + name           = "create-updates-premium-queue-send-connection-string"
      + value          = (sensitive value)
      + version        = (known after apply)
      + versionless_id = (known after apply)
    }

  # azurerm_key_vault_secret.create_updates_premium_queue_max_delivery_count will be created
  + resource "azurerm_key_vault_secret" "create_updates_premium_queue_max_delivery_count" {
      + id             = (known after apply)
      + key_vault_id   = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ethos-aat/providers/Microsoft.KeyVault/vaults/ethos-shared-aat"
      + name           = "create-updates-premium-queue-max-delivery-count"
      + value          = (sensitive value)
      + version        = (known after apply)
      + versionless_id = (known after apply)
    }

  # azurerm_key_vault_secret.update_case_premium_queue_listen_conn_str will be created
  + resource "azurerm_key_vault_secret" "update_case_premium_queue_listen_conn_str" {
      + id             = (known after apply)
      + key_vault_id   = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ethos-aat/providers/Microsoft.KeyVault/vaults/ethos-shared-aat"
      + name           = "update-case-premium-queue-listen-connection-string"
      + value          = (sensitive value)
      + version        = (known after apply)
      + versionless_id = (known after apply)
    }

  # azurerm_key_vault_secret.update_case_premium_queue_max_delivery_count will be created
  + resource "azurerm_key_vault_secret" "update_case_premium_queue_max_delivery_count" {
      + id             = (known after apply)
      + key_vault_id   = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ethos-aat/providers/Microsoft.KeyVault/vaults/ethos-shared-aat"
      + name           = "update-case-premium-queue-max-delivery-count"
      + value          = (sensitive value)
      + version        = (known after apply)
      + versionless_id = (known after apply)
    }

  # azurerm_key_vault_secret.update_case_premium_queue_send_conn_str will be created
  + resource "azurerm_key_vault_secret" "update_case_premium_queue_send_conn_str" {
      + id             = (known after apply)
      + key_vault_id   = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ethos-aat/providers/Microsoft.KeyVault/vaults/ethos-shared-aat"
      + name           = "update-case-premium-queue-send-connection-string"
      + value          = (sensitive value)
      + version        = (known after apply)
      + versionless_id = (known after apply)
    }

  # azurerm_resource_group.rg will be updated in-place
  ~ resource "azurerm_resource_group" "rg" {
        id       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ethos-aat"
        name     = "ethos-aat"
      ~ tags     = {
          - "Destroy Me"   = "No"
          - "Team Contact" = "#ethos-repl-service"
          - "application"  = "ethos"
          - "environment"  = "aat"
          - "lastUpdated"  = "2022-11-17T10:50:11Z"
          - "managedBy"    = "ECM Project"
        } -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.create-updates-premium-queue.data.azurerm_servicebus_namespace.this will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_servicebus_namespace" "this"  {
      + capacity                            = (known after apply)
      + default_primary_connection_string   = (sensitive value)
      + default_primary_key                 = (sensitive value)
      + default_secondary_connection_string = (sensitive value)
      + default_secondary_key               = (sensitive value)
      + id                                  = (known after apply)
      + location                            = (known after apply)
      + name                                = "ethos-aat-premium"
      + resource_group_name                 = "ethos-aat"
      + sku                                 = (known after apply)
      + tags                                = (known after apply)
      + zone_redundant                      = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.create-updates-premium-queue.azurerm_servicebus_queue.servicebus_queue will be created
  + resource "azurerm_servicebus_queue" "servicebus_queue" {
      + auto_delete_on_idle                     = "P10675199DT2H48M5.4775807S"
      + dead_lettering_on_message_expiration    = true
      + default_message_ttl                     = "P10675199DT2H48M5.4775807S"
      + duplicate_detection_history_time_window = "PT59M"
      + enable_batched_operations               = true
      + enable_express                          = false
      + enable_partitioning                     = false
      + id                                      = (known after apply)
      + lock_duration                           = "PT5M"
      + max_delivery_count                      = 10
      + max_message_size_in_kilobytes           = (known after apply)
      + max_size_in_megabytes                   = 1024
      + name                                    = "create-updates"
      + namespace_id                            = (known after apply)
      + requires_duplicate_detection            = true
      + requires_session                        = false
      + status                                  = "Active"
    }

  # module.create-updates-premium-queue.azurerm_servicebus_queue_authorization_rule.listen_auth_rule will be created
  + resource "azurerm_servicebus_queue_authorization_rule" "listen_auth_rule" {
      + id                                = (known after apply)
      + listen                            = true
      + manage                            = false
      + name                              = "ListenSharedAccessKey"
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + queue_id                          = (known after apply)
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = false
    }

  # module.create-updates-premium-queue.azurerm_servicebus_queue_authorization_rule.send_auth_rule will be created
  + resource "azurerm_servicebus_queue_authorization_rule" "send_auth_rule" {
      + id                                = (known after apply)
      + listen                            = false
      + manage                            = false
      + name                              = "SendSharedAccessKey"
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + queue_id                          = (known after apply)
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = true
    }

  # module.key-vault.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ethos-aat/providers/Microsoft.KeyVault/vaults/ethos-shared-aat|ethos-shared-aat"
        name                       = "ethos-shared-aat"
        # (2 unchanged attributes hidden)

      - log {
          - category = "AzurePolicyEvaluationDetails" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
        # (1 unchanged block hidden)
    }

  # module.servicebus-namespace-premium.azurerm_servicebus_namespace.servicebus_namespace will be created
  + resource "azurerm_servicebus_namespace" "servicebus_namespace" {
      + capacity                            = 1
      + default_primary_connection_string   = (sensitive value)
      + default_primary_key                 = (sensitive value)
      + default_secondary_connection_string = (sensitive value)
      + default_secondary_key               = (sensitive value)
      + id                                  = (known after apply)
      + local_auth_enabled                  = true
      + location                            = "uksouth"
      + name                                = "ethos-aat-premium"
      + resource_group_name                 = "ethos-aat"
      + sku                                 = "Premium"
      + tags                                = {
          + "BuiltFrom"           = "https://github.com/HMCTS/ecm-shared-infrastructure.git"
          + "application"         = "ethos"
          + "businessArea"        = "CFT"
          + "changeUrl"           = ""
          + "contactSlackChannel" = "#ethos-repl-service"
          + "environment"         = "staging"
          + "managedBy"           = "Ethos Replacement"
        }
      + zone_redundant                      = true
    }

  # module.servicebus-namespace-premium.azurerm_servicebus_namespace_authorization_rule.send_listen_auth_rule will be created
  + resource "azurerm_servicebus_namespace_authorization_rule" "send_listen_auth_rule" {
      + id                                = (known after apply)
      + listen                            = true
      + manage                            = false
      + name                              = "SendAndListenSharedAccessKey"
      + namespace_id                      = (known after apply)
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = true
    }

  # module.update-case-premium-queue.data.azurerm_servicebus_namespace.this will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_servicebus_namespace" "this"  {
      + capacity                            = (known after apply)
      + default_primary_connection_string   = (sensitive value)
      + default_primary_key                 = (sensitive value)
      + default_secondary_connection_string = (sensitive value)
      + default_secondary_key               = (sensitive value)
      + id                                  = (known after apply)
      + location                            = (known after apply)
      + name                                = "ethos-aat-premium"
      + resource_group_name                 = "ethos-aat"
      + sku                                 = (known after apply)
      + tags                                = (known after apply)
      + zone_redundant                      = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.update-case-premium-queue.azurerm_servicebus_queue.servicebus_queue will be created
  + resource "azurerm_servicebus_queue" "servicebus_queue" {
      + auto_delete_on_idle                     = "P10675199DT2H48M5.4775807S"
      + dead_lettering_on_message_expiration    = true
      + default_message_ttl                     = "P10675199DT2H48M5.4775807S"
      + duplicate_detection_history_time_window = "PT59M"
      + enable_batched_operations               = true
      + enable_express                          = false
      + enable_partitioning                     = false
      + id                                      = (known after apply)
      + lock_duration                           = "PT5M"
      + max_delivery_count                      = 10
      + max_message_size_in_kilobytes           = (known after apply)
      + max_size_in_megabytes                   = 1024
      + name                                    = "update-case"
      + namespace_id                            = (known after apply)
      + requires_duplicate_detection            = true
      + requires_session                        = false
      + status                                  = "Active"
    }

  # module.update-case-premium-queue.azurerm_servicebus_queue_authorization_rule.listen_auth_rule will be created
  + resource "azurerm_servicebus_queue_authorization_rule" "listen_auth_rule" {
      + id                                = (known after apply)
      + listen                            = true
      + manage                            = false
      + name                              = "ListenSharedAccessKey"
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + queue_id                          = (known after apply)
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = false
    }

  # module.update-case-premium-queue.azurerm_servicebus_queue_authorization_rule.send_auth_rule will be created
  + resource "azurerm_servicebus_queue_authorization_rule" "send_auth_rule" {
      + id                                = (known after apply)
      + listen                            = false
      + manage                            = false
      + name                              = "SendSharedAccessKey"
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + queue_id                          = (known after apply)
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = true
    }

Plan: 14 to add, 2 to change, 0 to destroy.
```

</details>


<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.key-vault.azurerm_key_vault.kv has changed
  ~ resource "azurerm_key_vault" "kv" {
      ~ access_policy                   = [
            # (3 unchanged elements hidden)
            {
                application_id          = ""
                certificate_permissions = [
                    "Create",
                    "Delete",
                    "DeleteIssuers",
                    "Get",
                    "GetIssuers",
                    "Import",
                    "List",
                    "ListIssuers",
                    "SetIssuers",
                    "Update",
                    "ManageContacts",
                    "ManageIssuers",
                ]
                key_permissions         = [
                    "Create",
                    "List",
                    "Get",
                    "Delete",
                    "Update",
                    "Import",
                    "Backup",
                    "Restore",
                    "Decrypt",
                    "Encrypt",
                    "UnwrapKey",
                    "WrapKey",
                    "Sign",
                    "Verify",
                ]
                object_id               = "ca6d5085-485a-417d-8480-c3cefa29df31"
                secret_permissions      = [
                    "Set",
                    "List",
                    "Get",
                    "Delete",
                    "Recover",
                    "Purge",
                ]
                storage_permissions     = []
                tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            },
          ~ {
              ~ certificate_permissions = [
                    # (10 unchanged elements hidden)
                    "DeleteIssuers",
                  + "Recover",
                ]
              ~ key_permissions         = [
                    # (4 unchanged elements hidden)
                    "Delete",
                  + "Recover",
                ]
              ~ secret_permissions      = [
                    # (2 unchanged elements hidden)
                    "Delete",
                  + "Recover",
                ]
                # (4 unchanged elements hidden)
            },
            {
                application_id          = ""
                certificate_permissions = [
                    "Get",
                    "List",
                ]
                key_permissions         = [
                    "Get",
                    "List",
                ]
                object_id               = "a8a3edfe-4c3c-4488-a077-58de149589a0"
                secret_permissions      = [
                    "Get",
                    "List",
                ]
                storage_permissions     = []
                tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            },
            # (1 unchanged element hidden)
        ]
        id                              = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ethos-aat/providers/Microsoft.KeyVault/vaults/ethos-shared-aat"
        name                            = "ethos-shared-aat"
        tags                            = {
            "Destroy Me"   = "No"
            "Team Contact" = "#ethos-repl-service"
            "application"  = "ethos"
            "environment"  = "aat"
            "managedBy"    = "ECM Project"
        }
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.key-vault.azurerm_monitor_diagnostic_setting.kv-ds has changed
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ethos-aat/providers/Microsoft.KeyVault/vaults/ethos-shared-aat|ethos-shared-aat"
        name                       = "ethos-shared-aat"
        # (2 unchanged attributes hidden)

      + log {
          + category = "AzurePolicyEvaluationDetails"
          + enabled  = false

          + retention_policy {
              + days    = 0
              + enabled = false
            }
        }

      + metric {
          + category = "AllMetrics"
          + enabled  = false

          + retention_policy {
              + days    = 0
              + enabled = false
            }
        }
        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":16,"Program":"tfcmt","SHA1":"","Vars":{}} -->